// Напишите программу, которая на вход принимает число 
// и выдает его квадрат (число умноженное на само себя)

Console.WriteLine("Введите ваше число: ");
// string? answer = Console.ReadLine();
// int number = Convert.ToInt32(answer);
int number = Convert.ToInt32(Console.ReadLine()); // заменяет строку 5 и 6

Console.WriteLine(number * number);